export interface ErrorResponse {
  errorCode: string;
}

export interface ApiResponse {
  code: string;
}

export function codeMap(key: string | undefined) {
  if (!key) return "";
  const errorCodeMap: { [key: string]: string } = {
    C100: "نام مشتری را وارد کنید",
    C101: "مشتری با این نام قبلا ثبت شده است",
    C102: "مشتری با این آی دی ثبت نشده است",
    C103: "مشتری با موفقیت حذف شد",
    D100: "تاریخ باید از - استفاده کندی",
    D101: " تاریخ غلط است روز ماه یا سال را چک کنید",
    B100: "بل فروش ثبت شد",
    B101: "شماره بل تکراری میباشد",
    B104: "بل با شماره داده شده پیدا نشد",
    B102: "بل خرید دارای رسید میباشد. ابتدا رسید را حذف کنید",
    B103: "بل خرید با موفقیت حذف شد",
    P100: "محصول قبلا ثبت شده است",
    E100: "بل خریداری ثبت شد",
    E101: "مشکل در ثبت بل خریداری",
    E102: "بل خریداری پیدا نشد تاریخ و نام فروشنده با چک کنید",
    R100: "رسید ثبت شد",
    R101: "مجموع مبلغ رسید شده بیشتر از مبلغ بل است",
    R102: "رسید حذف شد",
    R104: "رسید پیدا نشد",
  };

  return errorCodeMap[key];
}
